<template>
    <div class="m-2 content columns">
        <div class="container column">
            <div>
                <h1 class="title">
                    Karasearchについて
                </h1>
            </div>
            <div>
                <p>
                    Karasearchは<a href="https://www.osumiakari.jp">Osumi Akari</a>が作成しているカラオケ音源検索サイトです。
                </p>
                <p>
                    ここで言うカラオケ音源とは、YouTube等で公開されている音源であってかつ二次利用に適したライセンスを持ち、明確な形で二次利用の方法が示されているものを指します。すなわち以下の条件を満たす音源のことです。
                </p>
                <ul>
                    <li>元曲の著作権を侵害していないもの（作者自身が公開されているものも含む）</li>
                    <li>これが公に公開されているもの</li>
                    <li>（少なくとも非営利かつ特定サイトでの）利用によって追加の費用が生じないもの</li>
                    <li>二次利用について明確な方針が示されているもの</li>
                </ul>
                <p>
                    従来、これを完全に満たしたものの検索は極めて不便であると言わざるを得ないものであったと思います。この要因として様々なものが考えられます。
                </p>
                <p>
                    次に音源の二次利用についての情報が機械判読性の高くない形態で提供されていたという面があります。例えばクリエイティブコモンズライセンスの公式サイトでは（ものすごく高いとは思いませんが）機械判読性のある形でそのライセンスを示すことが出来る「<a href="https://creativecommons.org/choose/">Choose a License</a>」というサービスを提供されています。
                </p>
            </div>
            <div class="my-2">
                <h2 class="title">
                    「特定サイト」について
                </h2>
                <p>
                    当サイトで検索可能な音源の多くは、著作権者に対して明瞭な形での許可を取らずに第三者が作成し、それが動画共有サービス等へアップロードされているといった形式です。本来であればこのような音源は当サイトにおける検索対象に含めるべきではないものです。しかしながら著作権管理団体は特定のサイトと利用許諾契約を結んでおり、サービスによって異なりますが、ある一定の範囲内でそのユーザーが生成したコンテンツの公開を認めています。
                </p>
                <p>
                    日本にある著作権管理団体のうちJASRACはこのような目的について、<a href="https://www.jasrac.or.jp/info/network/pickup/movie.html">ある程度明確な指針</a>を与えています。ここにおいては基本的に収益を目的せず原盤権を侵害しなければ、大きな問題なくJASRACが管理している著作物を利用できるとしています。またYouTubeについては埋め込みの利用においても別段の手続きを取る必要が無いとしています。なおこれに該当するサイトの詳細な一覧は<a href="https://www.jasrac.or.jp/news/20/ugc.html">利用許諾契約を締結しているUGCサービスの一覧（JASRAC）</a>をご覧ください。
                </p>
                <p>
                    私はこれをまとめて「特定サイト」としKarasearchで扱っています。これらのサイトの音源を使用される際、多くのユースケースでは問題となることはないかと思います。しかしながら使用法によっては意図せず著作権を侵害してしまう可能性がありますので、その点に留意してご利用ください。
                </p>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
useHead({
    title: "Karasearchについて",
    meta: [
        { name: "description", content: "Karasearchは明瞭に二次利用が許可されたカラオケ音源を検索できるサイトです" }
    ]
})
</script>